# St7DeleteTransientNodeHistoryCase

Deletes the specified node history case for linear and nonlinear transient dynamic analysis.

Strand7 API Manual

long St7DeleteTransientNodeHistoryCase(long uID, long Pos)

Input Parameters

uID

Pos

Strand7 model file ID.

Node history case number.